Librerías

In [1]:
import pandas as pd
import numpy as np

Importar Datos

In [2]:
df = pd.read_csv("titanic_train.csv")

Revisar DataFrame

In [4]:
df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

Revisar Columnas

In [7]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

Renombrando Columnas

In [8]:
cabecera = ["id","sobreviviente","clase","nombre","sexo","edad","hermanos","hijos","ticket","tarifa","cabina","embarque"]

Reemplazando Columnas en el Dataframe

In [10]:
df.columns = cabecera

In [11]:
df.columns

Index(['id', 'sobreviviente', 'clase', 'nombre', 'sexo', 'edad', 'hermanos',
       'hijos', 'ticket', 'tarifa', 'cabina', 'embarque'],
      dtype='object')

Comprobando

In [12]:
df.head()

,id,sobreviviente,clase,nombre,sexo,edad,hermanos,hijos,ticket,tarifa,cabina,embarque
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

Exportar CSV

In [14]:
#Con index = false, ignoramos el indice por defecto en el dataframe para el csv. 
ruta = "titanic_español.csv"
df.to_csv(ruta,index=False)